# 0.1 Initialization

In [26]:
import pandas as pd
import numpy as np
import os

In [27]:
path = '/Users/matthewmacbook/Documents/CareerFoundry/Data Immersion/Achievement 4 - Python Fundamentals for Data Analysts/Instacart Basket Analysis 26-07-2023'

In [28]:
df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'products.csv'), index_col = False)
df_ords = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'orders_wrangled.csv'), index_col = False)

# 0.2 Mixed-Type Data

In [29]:
# create a data frame
df_test = pd.DataFrame()

In [30]:
# create a mixed column
df_test['mix'] = ['a', 'b', 1, True]

In [31]:
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [32]:
# check for mixed data types
for col in df_test.columns.tolist():
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

mix

# 0.3 Missing Values

In [33]:
# for each column sum the number of cells with null values
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [34]:
df_nan = df_prods[df_prods['product_name'].isnull() == True]

In [35]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

## There are a few ways to deal with missing data:

1. Create a new variable that acts like a flag based on the missing value.
2. Impute the value with the mean or median of the column (if the variable is numeric).
    df['column with missings'].fillna(mean value, inplace=True)
    df['column with missings'].fillna(median value, inplace=True)
3. Remove or filter out the missing data.

In [36]:
df_prods.shape

(49693, 5)

In [37]:
# Because the missing data are strings, we need to remove duplicates
df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

In [38]:
df_prods_clean.shape

(49677, 5)

In [39]:
# other way to removed missing values
# df_prods.dropna(inplace = True)
# df_prods.dropna(subset = [‘product_name’], inplace = True)
# inplace = True overwirties data frame

# 0.4 Duplicate Values

In [40]:
# finds and creates a data frame of duplicate rows
df_dups = df_prods_clean[df_prods_clean.duplicated()]
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [41]:
df_prods_clean.shape

(49677, 5)

In [42]:
# create new data frame by removing duplicates from products dataframe clean
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [43]:
df_prods_clean_no_dups.shape

(49672, 5)

In [44]:
# export products checked data frame into csv file in prepared data folder as 'products_checked.csv'
df_prods_clean_no_dups.to_csv(os.path.join(path, '02 Data', 'Prepared Data', 'products_checked.csv'), index=False)

# 0.4 Data Consistency Checks Task

In [45]:
df_ords.describe()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

From the above information, nothing stands out to me as being off or inconsistent.

In [46]:
# check for mixed data types in df_ords
for col in df_ords.columns.tolist():
  weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_ords[weird]) > 0:
    print (col)

No mixed data-type columns were found.

In [47]:
# for each column in df_ords, sum the number of cells with null values
df_ords.isnull().sum()

order_id                       0
user_id                        0
order_number                   0
orders_day_of_week             0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

The missing values in the days_since_prior_order columns are first time orders.

In [48]:
# create new column 'first_order' to indicate that the order is the first order of a user
df_ords['first_order'] = df_ords['days_since_prior_order'].isna()

In [49]:
df_ords.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,first_order
0,2539329,1,1,2,8,NaN,True
1,2398795,1,2,3,7,15.0,False
2,473747,1,3,3,12,21.0,False
3,2254736,1,4,4,7,29.0,False
4,431534,1,5,4,15,28.0,False

I decided to create a whole new column because their was nothing to impute and removing the rows with the 'empty' value would compromise the data as first-time-orders should be kept track of. In addiiton, first-time-orders are very much like other orders and therefore should remain in the dataset.

In [50]:
df_ords_dups = df_ords[df_ords.duplicated()]
df_ords_dups

Empty DataFrame
Columns: [order_id, user_id, order_number, orders_day_of_week, order_hour_of_day, days_since_prior_order, first_order]
Index: []

No duplicates were found.

In [51]:
# export orders data frame into csv file in prepared data folder as 'orders_checked.csv'
df_ords.to_csv(os.path.join(path, '02 Data','Prepared Data', 'orders_checked.csv'), index=False)